БухЭксп/Documents/CW_ВводОстатковНезавершенногоПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_ВводОстатковНезавершенногоПроизводства</Name>
			<BasedOn>
				<xr:Item>Document.CW_РасходыПоГрузоперевозке</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.CW_НезавершенноеПроизводство</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокументаВалютная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Грузоперевозка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокОтражения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособУчетаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыУчетаНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_СтатьяЗатрат</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>"Сумма" в базовой валюте учета</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС</Name>
							<Comment>"НДС" в базовой валюте учета</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Comment>"Всего" в базовой валюте учета</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма_Валюта</Name>
							<Comment>"Сумма" в валюте договора</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС_Валюта</Name>
							<Comment>"НДС" в валюте договора</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего_Валюта</Name>
							<Comment>"Всего" в валюте договора</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Покупатель</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорПокупателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриложениеКДоговоруПокупателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/Documents/CW_ВводОстатковНезавершенногоПроизводства/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	CW_Документы.УстановитьПараметрыФункциональныхОпцийФормы(Этаформа);
	
	ВалютаРег = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Если Не ЗначениеЗаполнено(Объект.Организация) тогда
		Объект.Организация = CW_Настройки.ОсновнаяОрганизация();
	Конецесли;
	
	Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
		Объект.Дата = ТекущаяДата();
	КонецЕсли;
	
	ПоказатьПодразделение = ложь;
	Если ЗначениеЗаполнено(Объект.Организация) тогда
		ПоказатьПодразделение = CW_Настройки.ПараметрУчетнойПолитики(Объект.Дата, Объект.Организация, "ГруппировкаЗатратПоПодразделениям");
	КонецЕсли;
	
	Элементы.ЗатратыПодразделение.Видимость = ПоказатьПодразделение;
	
	ТекущийДокументОснование = Объект.ДокументОснование;
	
	УстанавиливаемыеПараметры = Новый Структура("CW_ДоговорПоГрузоперевозкам", ТекущийДокументОснование.Договор);
	Элементы.ПриложениеКДоговору.Видимость = ПолучитьФункциональнуюОпцию("CW_УчитыватьПриложенияВДокументах",УстанавиливаемыеПараметры); 
	
	УстановитьВидимостьСпособУчетаНДСНаСервере();
	
	//Наличие прикрепленных файлов
	_УФКС.УстановитьНаличиеПрикрепленныхФайловПриСозданииФормыНаСервере(ЭтаФорма);
	//Наличие прикрепленных файлов

	//Для версии КОРП
	ВестиУчетПоПодразделениям					= ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям");
	Элементы.ПодразделениеОрганизации.Видимость	= ВестиУчетПоПодразделениям;
	//Для версии КОРП
	
	ЗаполнитьДополнительныеКолонки();
	
	Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	//Внешние подклчюаемые команды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьНадписьИтоговойСтроки();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект); // ВызовБП
	
	ЗаполнитьДополнительныеКолонки();
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.УстановитьПризнакУчетаПоПриложениямВТабличнойЧасти(ЭтаФорма, "Затраты", "ДоговорПокупателя");
	//Подсистема.УчетПриложенийДоговоров
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект); // ВызовБП
	
	ЗаполнитьДополнительныеКолонки();
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.УстановитьПризнакУчетаПоПриложениямВТабличнойЧасти(ЭтаФорма, "Затраты", "ДоговорПокупателя");
	//Подсистема.УчетПриложенийДоговоров

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДополнительныеКолонки() 

	Для каждого СтрокаДокумента Из Объект.Затраты Цикл
		СтрокаДокумента.Валюта 		= ТекущийДокументОснование.Валюта;
		СтрокаДокумента.ВалютаРег 	= ВалютаРег;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьСпособУчетаНДСНаСервере()
	
	УстанавливаемыеПараметры = Новый Структура;
	УстанавливаемыеПараметры.Вставить("Организация", Объект.Организация);
	
	Элементы.ЗатратыСпособУчетаНДС.Видимость = ПолучитьФункциональнуюОпцию("РаздельныйУчетНДСНаСчете19",УстанавливаемыеПараметры);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьНадписьИтоговойСтроки()
	
	Сумма 	= Объект.Затраты.Итог("Сумма");
	НДС 	= Объект.Затраты.Итог("НДС");
	Всего 	= Объект.Затраты.Итог("Всего");

	Элементы.ИтоговаяСтрока.Заголовок = 	
		"Сумма: "+Формат(Сумма, "ЧДЦ=2; ЧН=0.00")	+ " " + Строка(Валюта)+ "; " +
		"НДС: "+Формат(НДС, 	"ЧДЦ=2; ЧН=0.00")	+ " " + Строка(Валюта)+ "; " +
		"Всего: "+Формат(Всего, "ЧДЦ=2; ЧН=0.00")	+ " " + Строка(Валюта)+ "; ";
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	УстановитьВидимостьСпособУчетаНДСНаСервере();
КонецПроцедуры

//Команды табличной части
&НаКлиенте
Процедура ЗатратыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	УстановитьНадписьИтоговойСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыПослеУдаления(Элемент)
	УстановитьНадписьИтоговойСтроки();
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	
	Если Объект.Затраты.Количество() > 0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПродолжитьОчисткуТабличнойЧасти", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, "Табличная часть документа будет очищена. Продолжить?", Режим, 0);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьОчисткуТабличнойЧасти(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Затраты.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Отказ = Ложь;
	Если Не ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен документ реализации!",,"ДокументОснование","Объект", Отказ);
	КонецЕсли;
	
	Если Не Отказ тогда
		
		ДополнительныеПараметры = Новый Структура;
		Оповещение = Новый ОписаниеОповещения("ПродолжитьЗаполнить", ЭтотОбъект, ДополнительныеПараметры);
		
		Если Объект.Затраты.Количество() > 0 Тогда
			СтандартнаяОбработка = Ложь;
			Режим = РежимДиалогаВопрос.ДаНет;
			ПоказатьВопрос(Оповещение, "Табличная часть документа будет очищена. Продолжить?", Режим, 0);
		Иначе
			ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьЗаполнить(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТабличнуюЧастьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличнуюЧастьНаСервере()
	
	ТОбъект = РеквизитФормыВЗначение("Объект");
	РезультатЗапроса = ТОбъект.ПолучитьДанныеДляЗаполненияТабличнойЧасти(Объект.ДокументОснование);
	
	Объект.Затраты.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ДокументОснованиеПриИзмененииНаСервере()
	
	Объект.Затраты.Очистить();
	ТекущийДокументОснование 	= Объект.ДокументОснование;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Элемент", Элемент);
	Оповещение = Новый ОписаниеОповещения("ПродолжитьДокументОснованиеПриИзменении", ЭтотОбъект, ДополнительныеПараметры);
	
	Если Объект.Затраты.Количество() > 0 и ЗначениеЗаполнено(ТекущийДокументОснование) и ТекущийДокументОснование <> Объект.ДокументОснование Тогда
		СтандартнаяОбработка = Ложь;
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение, "Табличная часть документа будет очищена. Продолжить?", Режим, 0);
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьДокументОснованиеПриИзменении(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Объект.ДокументОснование =  ТекущийДокументОснование;
		Возврат;
	КонецЕсли;
	
	ДокументОснованиеПриИзмененииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Элемент", Элемент);
	Оповещение = Новый ОписаниеОповещения("ПродолжитьИзменениеДокументаоснования", ЭтотОбъект, ДополнительныеПараметры);
	
	Если Объект.Затраты.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение, "Табличная часть документа будет очищена. Продолжить?", Режим, 0);
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьИзменениеДокументаоснования(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Организация", 				Объект.Организация);
	СтруктураОтбора.Вставить("ПодразделениеОрганизации", 	Объект.ПодразделениеОрганизации);
	СтруктураОтбора.Вставить("ПредъявленАкт", 				Истина);
	
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("РежимВыбора", 		Истина);
	ПараметрыФормыВыбора.Вставить("МножественныйВыбор", Ложь);
	ПараметрыФормыВыбора.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормыВыбора.Вставить("Отбор", 				СтруктураОтбора);
	
	ОткрытьФорму("Документ.CW_РасходыПоГрузоперевозке.ФормаВыбора", ПараметрыФормыВыбора, ДополнительныеПараметры.Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ЗатратыНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Затраты.ТекущаяСтрока;   
	ПриИзмененииНоменклатурыНаСервере(ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииНоменклатурыНаСервере(ТекущаяСтрока)
	
	ТекущиеДанные = Объект.Затраты.НайтиПоИдентификатору(ТекущаяСтрока);
		
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Дата"					, Объект.Дата);
	СтруктураПараметров.Вставить("Организация"			, Объект.Организация);
	СтруктураПараметров.Вставить("Номенклатура"			, ТекущиеДанные.Номенклатура);
	СтруктураПараметров.Вставить("НоменклатурнаяГруппа"	, ТекущиеДанные.Номенклатура.НоменклатурнаяГруппа);
	
	ТекущиеДанные.СпособУчетаНДС = CW_Финансы.ПолучитьСпособУчетаНДС(СтруктураПараметров);

КонецПроцедуры
//Команды табличной части


//Наличие прикрепленных файлов
&НаСервере
Процедура ОбработатьОповещениеОбновитьНаличиеПрикрепленныхФайлов()
	
	CW_РаботаСФайламиСервер.УстановитьНаличиеПрикрепленныхФайловПриСозданииФормыНаСервере(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиФайловНажатие(Элемент, СтандартнаяОбработка)
	
	CW_РаботаСФайламиКлиент.АдресКартинкиФайловНажатие(ЭтаФорма, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиФайловПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	СтандартнаяОбработка  = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиФайловПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	CW_РаботаСФайламиКлиент.АдресКартинкиФайловПеретаскивание(ЭтаФорма, ПараметрыПеретаскивания, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	//Наличие прикрепленных файлов
	Если ИмяСобытия = "ОбновитьНаличиеПрикрепленныхФайлов" Тогда
		
		ОбработатьОповещениеОбновитьНаличиеПрикрепленныхФайлов();
		//Наличие прикрепленных файлов
		
	КонецЕсли;
	
КонецПроцедуры
//Наличие прикрепленных файлов

//Внешние подклчюаемые команды
&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры
//Внешние подклчюаемые команды  


//Групповое релдактирование реквизитов
&НаКлиенте
Процедура ГрупповоеРедактированиеРеквизитов(Команда) 
	
	ВыделенныеСтроки = Элементы.Затраты.ВыделенныеСтроки;   
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВыделенныеСтроки", ВыделенныеСтроки);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьГрупповоеРедактированиеРеквизитов", ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("ПоказатьПодразделение", 	ПоказатьПодразделение);
	ПараметрыОткрытияФормы.Вставить("Организация", 				Объект.Организация);
	
	ОткрытьФорму("Документ.CW_ВводОстатковНезавершенногоПроизводства.Форма.ФормаГрупповогоРедактированияРеквизитов", ПараметрыОткрытияФормы, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры         

&НаКлиенте
Процедура ЗавершитьГрупповоеРедактированиеРеквизитов(РезультатВыбора, ДополнительныеПараметры) Экспорт   
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗавершитьГрупповоеРедактированиеРеквизитовНаСервере(РезультатВыбора, ДополнительныеПараметры.ВыделенныеСтроки);	  
	
	Модифицированность = Истина;
	
КонецПроцедуры


&НаСервере
Процедура ЗавершитьГрупповоеРедактированиеРеквизитовНаСервере(РезультатВыбора, ВыделенныеСтроки) 

	Для Каждого ИдентификаторСтроки из ВыделенныеСтроки Цикл
		СтрокаТекущая = Объект.Затраты.НайтиПоИдентификатору(ИдентификаторСтроки); 
		Для Каждого КлючЗначение из РезультатВыбора Цикл
			СтрокаТекущая[КлючЗначение.Ключ] = КлючЗначение.Значение;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры


//Групповое релдактирование реквизитов
